
INSERT INTO branches (branch_name, b_address, phone_n, opening_time, closing_time) VALUES
('Антикафе на Ленина', 'ул. Ленина, 15, Москва', '+79161234567', '10:00', '23:00'),
('Антикафе на Пушкина', 'ул. Пушкина, 42, Санкт-Петербург', '+79261234568', '11:00', '00:00'),
('Антикафе Центральный', 'пр. Мира, 8, Казань', '+79361234569', '09:00', '22:00');


INSERT INTO room_types (room_type_name, capacity) VALUES
('Стандарт', 4),
('Комфорт', 6),
('VIP', 10),
('PlayStation-зона', 4),
('Кинозал', 12);


INSERT INTO tariffs (room_type_id, tariff_name, duration_min, price) VALUES
(1, 'Стандарт 1 час', 60, 300.00),
(1, 'Стандарт 3 часа', 180, 750.00),
(2, 'Комфорт 1 час', 60, 450.00),
(2, 'Комфорт безлимит', 480, 1500.00),
(3, 'VIP 2 часа', 120, 1200.00),
(3, 'VIP вечер (5 часов)', 300, 2500.00),
(4, 'PS-зона 1 час', 60, 400.00),
(4, 'PS-зона 2 часа', 120, 700.00),
(5, 'Кинозал 3 часа', 180, 1800.00);


INSERT INTO menu_items (item_name, category, price, is_available) VALUES
('Капучино', 'Напитки', 180.00, TRUE),
('Латте', 'Напитки', 190.00, TRUE),
('Чай зелёный', 'Напитки', 120.00, TRUE),
('Кока-Кола', 'Напитки', 150.00, TRUE),
('Сэндвич с курицей', 'Закуски', 250.00, TRUE),
('Пицца Маргарита', 'Горячее', 550.00, TRUE),
('Картофель фри', 'Закуски', 200.00, TRUE),
('Чизкейк', 'Десерты', 280.00, TRUE),
('Мороженое', 'Десерты', 150.00, FALSE),
('Попкорн', 'Закуски', 100.00, TRUE);

INSERT INTO clients (full_name, phone, email, birth_date, loyalty_points) VALUES
('Иванов Иван Иванович', '+79001112233', 'ivanov@mail.ru', '1990-05-15', 120),
('Петрова Анна Сергеевна', '+79002223344', 'petrova@gmail.com', '1995-11-23', 45),
('Сидоров Пётр Алексеевич', '+79003334455', 'sidorov@yandex.ru', '1988-02-08', 300),
('Кузнецова Мария Дмитриевна', '+79004445566', 'kuznetsova@mail.ru', '2000-07-30', 10),
('Смирнов Олег Викторович', '+79005556677', NULL, '1992-09-12', 0);

INSERT INTO employees (branch_id, full_name, speciality, phone_n, email, hire_date, is_active) VALUES
(1, 'Орлов Дмитрий Сергеевич', 'Администратор', '+79161112233', 'orlov@anticafe.ru', '2022-03-01', TRUE),
(1, 'Белова Екатерина Игоревна', 'Бариста', '+79162223344', 'belova@anticafe.ru', '2023-01-15', TRUE),
(2, 'Морозов Артём Павлович', 'Администратор', '+79262223344', 'morozov@anticafe.ru', '2021-06-10', TRUE),
(2, 'Волкова Ольга Андреевна', 'Официант', '+79263334455', 'volkova@anticafe.ru', '2024-02-20', TRUE),
(3, 'Новиков Сергей Владимирович', 'Управляющий', '+79363334455', 'novikov@anticafe.ru', '2020-09-05', TRUE),
(3, 'Захарова Юлия Романовна', 'Администратор', '+79364445566', NULL, '2023-08-12', FALSE);

INSERT INTO orders (branch_id, room_type_id, tariff_id, employee_id, opened_at, closed_at, is_active, total_amount) VALUES
(1, 1, 2, 1, '2024-05-10 14:00:00', '2024-05-10 17:00:00', FALSE, 1250.00),
(1, 2, 4, 2, '2024-05-11 18:00:00', '2024-05-12 02:00:00', FALSE, 2100.00),
(2, 3, 6, 3, '2024-05-12 19:00:00', '2024-05-13 00:00:00', FALSE, 2800.00),
(3, 4, 8, 5, '2024-05-13 16:00:00', '2024-05-13 18:00:00', FALSE, 900.00),
(1, 1, 1, 1, '2024-05-14 12:00:00', NULL, TRUE, 300.00),
(2, 5, 9, 4, '2024-05-14 20:00:00', NULL, TRUE, 1800.00);


INSERT INTO order_clients (order_id, client_id, is_responsible) VALUES
(1, 1, TRUE),
(1, 2, FALSE),
(2, 3, TRUE),
(3, 4, TRUE),
(4, 5, TRUE),
(5, 1, TRUE),
(6, 3, TRUE),
(6, 4, FALSE);

INSERT INTO order_menu_items (order_id, menu_item_id, quantity) VALUES
(1, 1, 2),   
(1, 5, 1),  
(2, 3, 4),   
(2, 6, 1),   
(2, 10, 2),  
(3, 2, 2),   
(3, 8, 3),   
(4, 4, 2),   
(4, 7, 1),   
(5, 1, 1),  
(6, 9, 4),   
(6, 4, 3);   