INSERT INTO books (isbn, b_title, b_pub_year) VALUES
    ('978-0-141-43951-8', 'Мёртвые души', 1842),
    ('978-0-316-62461-6', 'Капитанская Дочка', 1836),
    ('979-8-218-02715-5', 'Библиотекарь', 2007),
    ('979-8-219-02346-6', 'Грех', 2007),
    ('979-8-223-03456-6', 'Жизнь насекомых', 1993),
    ('978-5-723-24572-7', 'Трудно быть богом', 1964);

INSERT INTO creators (c_name) VALUES
    ('Александр Пушкин'),
    ('Николай Гоголь'),
    ('Виктор Пелевин'),
    ('Михаил Елизаров'),
    ('Захар Прилепин'),
    ('Аркадий Стругацкий'),
    ('Борис Стругацкий');

INSERT INTO book_creators (isbn, c_id) VALUES
    ('978-0-141-43951-8', 1),
    ('978-0-316-62461-6', 2),
    ('979-8-218-02715-5', 3),
    ('979-8-219-02346-6', 4),
    ('979-8-223-03456-6', 5),
    ('978-5-723-24572-7', 6),
    ('978-5-723-24572-7', 7);


INSERT INTO readers (r_name, r_number) VALUES
    ('Сергей Иванов', '+7-984-371-23-74'),
    ('Станислав Васильев', '+7-946-356-35-38'),
    ('Анатолий Стрекоза', '+7-998-269-69-64'),
    ('Даниил Прокапенко', '+7-935-815-75-52');






INSERT INTO Control (readers_id, isbn, date_of_give, date_of_s_back, date_of_back) VALUES
    (1, '978-0-141-43951-8', '2026-01-11', '2026-02-25', '2026-02-21'),
    (2, '978-0-316-62461-6', '2026-03-13', '2026-04-30', '2026-04-25'),
    (3, '979-8-218-02715-5', '2026-04-30', '2026-05-15', '2026-05-03'),
    (3, '979-8-219-02346-6', '2026-05-21', '2026-06-15', '2026-05-28'),
    (3, '979-8-223-03456-6', '2026-05-02', '2026-05-28', NULL),
    (5, '978-5-17-118366-8', '2026-06-12', '2026-06-30', NULL);



UPDATE readers
SET r_number = '+7-913-314-32-75'
WHERE readers_id = 1;

UPDATE Control
SET date_of_back = '2026-07-15'
WHERE Order_id = 5;

INSERT INTO readers (r_name, r_number)
VALUES ('Тестовый Читатель', '+7-900-000-00-00');

DELETE FROM readers
WHERE r_name = 'Тестовый Читатель';
